/*
Navicat MySQL Data Transfer

Source Server         : admin
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : cycletwo

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2017-05-25 12:55:22
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员用户id',
  `username` varchar(30) NOT NULL COMMENT '用户名;unique',
  `password` varchar(50) NOT NULL COMMENT '密码,not null',
  `salt` varchar(50) NOT NULL COMMENT '盐值,not null',
  `regtime` datetime DEFAULT NULL COMMENT '注册时间',
  `is_use` int(255) NOT NULL DEFAULT '1' COMMENT '用户状态;1-启用;2-禁用,默认1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username_unique` (`username`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'danbu', '7fbf44d6f6aebac6e0ccbb142253e57f', 'dd068679fc8617997ffed7b5951ec4b7', '2017-04-25 11:29:15', '1');
INSERT INTO `admin` VALUES ('2', 'cziyu', '0d5d4390351d6c0f8709261edcaa0657', 'f67c1e6c92799539faa071b644e00ee8', '2017-04-25 12:00:30', '1');
INSERT INTO `admin` VALUES ('3', 'cliven', '69cb337bdced90cc897cd5a0915a7aa5', '3f6d0a389f6b9b63a917a561091e2bea', '2017-04-25 12:00:40', '1');
INSERT INTO `admin` VALUES ('4', 'zjvivi', 'd9bc4d7a6b692bdc6e888b882b8e4098', '3b83dfb4f188f74a50c4446a4ad46745', '2017-04-25 12:00:57', '1');
INSERT INTO `admin` VALUES ('5', 'admin', '5ce9582e1ec840a90ffc3f2c0040c42d', 'afd73272112d5a853f8a3ba0df5668a0', '2017-04-25 12:01:06', '1');
INSERT INTO `admin` VALUES ('8', 'test1', '02ee4466e67176bf89f15ade50e52955', '644f87520680428170dadbd24faecbaa', '2017-04-25 22:02:09', '2');
INSERT INTO `admin` VALUES ('13', 'admin2', '6f7544bfef629e059c12e2527299c03c', '487ad27a47f62ea06c21f9fd9e50840a', '2017-04-27 16:04:41', '1');

-- ----------------------------
-- Table structure for bike
-- ----------------------------
DROP TABLE IF EXISTS `bike`;
CREATE TABLE `bike` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自行车id;PK',
  `bikecode` varchar(255) DEFAULT NULL COMMENT '生产编号;unique',
  `pctime` datetime DEFAULT NULL COMMENT '采购时间;date',
  `lng` float DEFAULT NULL COMMENT '经度',
  `lat` float DEFAULT NULL COMMENT '纬度',
  `bikestate` int(255) DEFAULT '1' COMMENT '自行车状态;1-正常;2-损坏;3-待维修,默认1',
  `is_lend` int(255) DEFAULT '0' COMMENT '0-空闲;1-表示使用中;默认0',
  `is_use` int(255) NOT NULL DEFAULT '1' COMMENT '记录可用状态;NOT NULL;1-启用;2-禁用,默认1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `bikecode` (`bikecode`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=466 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of bike
-- ----------------------------
INSERT INTO `bike` VALUES ('158', 'ZH000000', '2017-05-11 19:36:06', '130.934', '126.188', '1', '0', '2');
INSERT INTO `bike` VALUES ('159', 'ZH000001', '2017-05-11 19:36:06', '453', '542', '2', '0', '2');
INSERT INTO `bike` VALUES ('160', 'ZH000002', '2017-05-11 19:36:06', '81.2675', '149.867', '1', '0', '1');
INSERT INTO `bike` VALUES ('161', 'ZH000003', '2017-05-11 19:36:06', '34.6439', '44.6913', '1', '0', '1');
INSERT INTO `bike` VALUES ('162', 'ZH000004', '2017-05-11 19:36:06', '183.857', '191.716', '1', '0', '1');
INSERT INTO `bike` VALUES ('163', 'ZH000005', '2017-05-11 19:36:06', '22.0933', '24.0006', '1', '0', '1');
INSERT INTO `bike` VALUES ('164', 'ZH000006', '2017-05-11 19:36:06', '19.482', '170.873', '2', '0', '1');
INSERT INTO `bike` VALUES ('165', 'ZH000007', '2017-05-11 19:36:06', '610', '285', '2', '0', '1');
INSERT INTO `bike` VALUES ('166', 'ZH000008', '2017-05-11 19:36:07', '50.212', '113.768', '2', '0', '1');
INSERT INTO `bike` VALUES ('167', 'ZH000009', '2017-05-11 19:36:07', '160.425', '20.0727', '2', '0', '1');
INSERT INTO `bike` VALUES ('168', 'ZH000010', '2017-05-11 19:36:07', '675', '-924', '2', '0', '1');
INSERT INTO `bike` VALUES ('169', 'ZH000011', '2017-05-11 19:36:07', '-818', '160', '2', '0', '1');
INSERT INTO `bike` VALUES ('170', 'ZH000012', '2017-05-11 19:36:07', '-925', '-546', '2', '0', '1');
INSERT INTO `bike` VALUES ('171', 'ZH000013', '2017-05-11 19:36:07', '-30', '294', '2', '0', '1');
INSERT INTO `bike` VALUES ('172', 'ZH000014', '2017-05-11 19:36:07', '189.324', '141.807', '1', '0', '1');
INSERT INTO `bike` VALUES ('173', 'ZH000015', '2017-05-11 19:36:07', '130.311', '42.2186', '1', '0', '1');
INSERT INTO `bike` VALUES ('174', 'ZH000016', '2017-05-11 19:36:07', '658', '512', '1', '0', '1');
INSERT INTO `bike` VALUES ('175', 'ZH000017', '2017-05-11 19:36:07', '175.778', '164.064', '1', '0', '1');
INSERT INTO `bike` VALUES ('176', 'ZH000018', '2017-05-11 19:36:07', '-782', '66', '3', '0', '1');
INSERT INTO `bike` VALUES ('177', 'ZH000019', '2017-05-11 19:36:07', '-409', '-263', '3', '0', '1');
INSERT INTO `bike` VALUES ('178', 'ZH000020', '2017-05-11 19:36:07', '-462', '554', '3', '0', '1');
INSERT INTO `bike` VALUES ('179', 'ZH000021', '2017-05-11 19:36:07', '176', '-644', '3', '0', '1');
INSERT INTO `bike` VALUES ('180', 'ZH000022', '2017-05-11 19:36:07', '808', '-86', '3', '0', '1');
INSERT INTO `bike` VALUES ('181', 'ZH000023', '2017-05-11 19:36:07', '428', '439', '3', '0', '1');
INSERT INTO `bike` VALUES ('182', 'ZH000024', '2017-05-11 19:36:07', '-784', '-918', '3', '0', '1');
INSERT INTO `bike` VALUES ('183', 'ZH000025', '2017-05-11 19:36:07', '37', '-574', '3', '0', '1');
INSERT INTO `bike` VALUES ('184', 'ZH000026', '2017-05-11 19:36:07', '-53', '-5', '3', '0', '1');
INSERT INTO `bike` VALUES ('185', 'ZH000027', '2017-05-11 19:36:07', '-312', '-248', '3', '0', '1');
INSERT INTO `bike` VALUES ('186', 'ZH000028', '2017-05-11 19:36:07', '-810', '-407', '3', '0', '1');
INSERT INTO `bike` VALUES ('187', 'ZH000029', '2017-05-11 19:36:07', '-930', '-145', '3', '0', '1');
INSERT INTO `bike` VALUES ('188', 'ZH000030', '2017-05-11 19:36:07', '58.7353', '154.93', '1', '1', '1');
INSERT INTO `bike` VALUES ('189', 'ZH000031', '2017-05-11 19:36:07', '868', '-827', '1', '0', '1');
INSERT INTO `bike` VALUES ('190', 'ZH000032', '2017-05-11 19:36:07', '960', '-412', '1', '0', '1');
INSERT INTO `bike` VALUES ('191', 'ZH000033', '2017-05-11 19:36:07', '774', '143', '1', '0', '1');
INSERT INTO `bike` VALUES ('192', 'ZH000034', '2017-05-11 19:36:07', '863', '861', '1', '0', '1');
INSERT INTO `bike` VALUES ('193', 'ZH000035', '2017-05-11 19:36:07', '-528', '203', '1', '0', '1');
INSERT INTO `bike` VALUES ('194', 'ZH000036', '2017-05-11 19:36:07', '28', '568', '1', '0', '1');
INSERT INTO `bike` VALUES ('195', 'ZH000037', '2017-05-11 19:36:07', '650', '-209', '1', '0', '1');
INSERT INTO `bike` VALUES ('196', 'ZH000038', '2017-05-11 19:36:07', '-357', '646', '1', '0', '1');
INSERT INTO `bike` VALUES ('197', 'ZH000039', '2017-05-11 19:36:07', '996', '344', '1', '0', '1');
INSERT INTO `bike` VALUES ('198', 'ZH000040', '2017-05-11 19:36:07', '-107', '33', '1', '0', '1');
INSERT INTO `bike` VALUES ('199', 'ZH000041', '2017-05-11 19:36:07', '199', '298', '1', '0', '1');
INSERT INTO `bike` VALUES ('200', 'ZH000042', '2017-05-11 19:36:07', '-32', '665', '1', '0', '1');
INSERT INTO `bike` VALUES ('201', 'ZH000043', '2017-05-11 19:36:07', '943', '-906', '1', '0', '1');
INSERT INTO `bike` VALUES ('202', 'ZH000044', '2017-05-11 19:36:07', '55', '-518', '1', '0', '1');
INSERT INTO `bike` VALUES ('203', 'ZH000045', '2017-05-11 19:36:07', '918', '-834', '1', '0', '1');
INSERT INTO `bike` VALUES ('204', 'ZH000046', '2017-05-11 19:36:07', '-659', '418', '1', '0', '1');
INSERT INTO `bike` VALUES ('205', 'ZH000047', '2017-05-11 19:36:07', '812', '-48', '1', '0', '1');
INSERT INTO `bike` VALUES ('206', 'ZH000048', '2017-05-11 19:36:07', '13', '414', '1', '0', '1');
INSERT INTO `bike` VALUES ('207', 'ZH000049', '2017-05-11 19:36:07', '311', '-109', '1', '0', '1');
INSERT INTO `bike` VALUES ('208', 'ZH000050', '2017-05-11 19:36:07', '-739', '-593', '1', '0', '1');
INSERT INTO `bike` VALUES ('209', 'ZH000051', '2017-05-11 19:36:07', '103', '420', '1', '0', '1');
INSERT INTO `bike` VALUES ('210', 'ZH000052', '2017-05-11 19:36:07', '-731', '332', '1', '0', '1');
INSERT INTO `bike` VALUES ('211', 'ZH000053', '2017-05-11 19:36:07', '-125', '-23', '1', '0', '1');
INSERT INTO `bike` VALUES ('212', 'ZH000054', '2017-05-11 19:36:07', '-773', '-871', '1', '0', '1');
INSERT INTO `bike` VALUES ('213', 'ZH000055', '2017-05-11 19:36:07', '315', '-2', '1', '0', '1');
INSERT INTO `bike` VALUES ('214', 'ZH000056', '2017-05-11 19:36:07', '-679', '733', '1', '0', '1');
INSERT INTO `bike` VALUES ('215', 'ZH000057', '2017-05-11 19:36:07', '-889', '921', '1', '0', '1');
INSERT INTO `bike` VALUES ('216', 'ZH000058', '2017-05-11 19:36:07', '739', '-915', '1', '0', '1');
INSERT INTO `bike` VALUES ('217', 'ZH000059', '2017-05-11 19:36:07', '949', '185', '1', '0', '1');
INSERT INTO `bike` VALUES ('218', 'ZH000060', '2017-05-11 19:36:07', '-330', '-880', '1', '0', '1');
INSERT INTO `bike` VALUES ('219', 'ZH000061', '2017-05-11 19:36:07', '-481', '226', '1', '0', '1');
INSERT INTO `bike` VALUES ('220', 'ZH000062', '2017-05-11 19:36:07', '-700', '776', '1', '0', '1');
INSERT INTO `bike` VALUES ('221', 'ZH000063', '2017-05-11 19:36:07', '-494', '481', '1', '0', '1');
INSERT INTO `bike` VALUES ('222', 'ZH000064', '2017-05-11 19:36:07', '-184', '990', '1', '0', '1');
INSERT INTO `bike` VALUES ('223', 'ZH000065', '2017-05-11 19:36:07', '598', '-610', '1', '0', '1');
INSERT INTO `bike` VALUES ('224', 'ZH000066', '2017-05-11 19:36:07', '406', '-299', '1', '0', '1');
INSERT INTO `bike` VALUES ('225', 'ZH000067', '2017-05-11 19:36:07', '-516', '387', '1', '0', '1');
INSERT INTO `bike` VALUES ('226', 'ZH000068', '2017-05-11 19:36:07', '-741', '-154', '1', '0', '1');
INSERT INTO `bike` VALUES ('227', 'ZH000069', '2017-05-11 19:36:07', '-150', '-88', '1', '0', '1');
INSERT INTO `bike` VALUES ('228', 'ZH000070', '2017-05-11 19:36:07', '-439', '-639', '1', '0', '1');
INSERT INTO `bike` VALUES ('229', 'ZH000071', '2017-05-11 19:36:07', '383', '-597', '1', '0', '1');
INSERT INTO `bike` VALUES ('230', 'ZH000072', '2017-05-11 19:36:07', '-501', '-815', '1', '0', '1');
INSERT INTO `bike` VALUES ('231', 'ZH000073', '2017-05-11 19:36:07', '773', '-705', '1', '0', '1');
INSERT INTO `bike` VALUES ('232', 'ZH000074', '2017-05-11 19:36:07', '261', '-745', '1', '0', '1');
INSERT INTO `bike` VALUES ('233', 'ZH000075', '2017-05-11 19:36:07', '-295', '-973', '1', '0', '1');
INSERT INTO `bike` VALUES ('234', 'ZH000076', '2017-05-11 19:36:07', '35', '508', '1', '0', '1');
INSERT INTO `bike` VALUES ('235', 'ZH000077', '2017-05-11 19:36:07', '868', '-963', '1', '0', '1');
INSERT INTO `bike` VALUES ('236', 'ZH000078', '2017-05-11 19:36:07', '9', '883', '1', '0', '1');
INSERT INTO `bike` VALUES ('237', 'ZH000079', '2017-05-11 19:36:07', '949', '760', '1', '0', '1');
INSERT INTO `bike` VALUES ('238', 'ZH000080', '2017-05-11 19:36:07', '369', '-683', '1', '0', '1');
INSERT INTO `bike` VALUES ('239', 'ZH000081', '2017-05-11 19:36:07', '-365', '637', '1', '0', '1');
INSERT INTO `bike` VALUES ('240', 'ZH000082', '2017-05-11 19:36:07', '303', '-254', '1', '0', '1');
INSERT INTO `bike` VALUES ('241', 'ZH000083', '2017-05-11 19:36:07', '-385', '104', '1', '0', '1');
INSERT INTO `bike` VALUES ('242', 'ZH000084', '2017-05-11 19:36:07', '-1', '-890', '1', '0', '1');
INSERT INTO `bike` VALUES ('243', 'ZH000085', '2017-05-11 19:36:07', '574', '-402', '1', '0', '1');
INSERT INTO `bike` VALUES ('244', 'ZH000086', '2017-05-11 19:36:07', '644', '-656', '1', '0', '1');
INSERT INTO `bike` VALUES ('245', 'ZH000087', '2017-05-11 19:36:07', '-798', '556', '1', '0', '1');
INSERT INTO `bike` VALUES ('246', 'ZH000088', '2017-05-11 19:36:07', '426', '-614', '1', '0', '1');
INSERT INTO `bike` VALUES ('247', 'ZH000089', '2017-05-11 19:36:07', '-815', '-582', '1', '0', '1');
INSERT INTO `bike` VALUES ('248', 'ZH000090', '2017-05-11 19:36:07', '532', '-825', '1', '0', '1');
INSERT INTO `bike` VALUES ('249', 'ZH000091', '2017-05-11 19:36:07', '-788', '-381', '1', '0', '1');
INSERT INTO `bike` VALUES ('250', 'ZH000092', '2017-05-11 19:36:07', '-849', '-353', '1', '0', '1');
INSERT INTO `bike` VALUES ('251', 'ZH000093', '2017-05-11 19:36:07', '967', '-403', '1', '0', '1');
INSERT INTO `bike` VALUES ('252', 'ZH000094', '2017-05-11 19:36:07', '-532', '740', '1', '0', '1');
INSERT INTO `bike` VALUES ('253', 'ZH000095', '2017-05-11 19:36:07', '-857', '790', '1', '0', '1');
INSERT INTO `bike` VALUES ('254', 'ZH000096', '2017-05-11 19:36:07', '-328', '-607', '1', '0', '1');
INSERT INTO `bike` VALUES ('255', 'ZH000097', '2017-05-11 19:36:07', '-577', '-364', '1', '0', '1');
INSERT INTO `bike` VALUES ('256', 'ZH000098', '2017-05-11 19:36:07', '949', '-459', '1', '0', '1');
INSERT INTO `bike` VALUES ('257', 'ZH000099', '2017-05-11 19:36:07', '495', '-429', '1', '0', '1');
INSERT INTO `bike` VALUES ('258', 'ZH000100', '2017-05-11 19:36:07', '-510', '123', '1', '0', '1');
INSERT INTO `bike` VALUES ('259', 'ZH000101', '2017-05-11 19:36:07', '49', '-966', '1', '0', '1');
INSERT INTO `bike` VALUES ('260', 'ZH000102', '2017-05-11 19:36:07', '478', '-924', '1', '0', '1');
INSERT INTO `bike` VALUES ('261', 'ZH000103', '2017-05-11 19:36:07', '770', '-539', '1', '0', '1');
INSERT INTO `bike` VALUES ('262', 'ZH000104', '2017-05-11 19:36:07', '104', '-662', '1', '0', '1');
INSERT INTO `bike` VALUES ('263', 'ZH000105', '2017-05-11 19:36:07', '347', '-709', '1', '0', '1');
INSERT INTO `bike` VALUES ('264', 'ZH000106', '2017-05-11 19:36:07', '-446', '844', '1', '0', '1');
INSERT INTO `bike` VALUES ('265', 'ZH000107', '2017-05-11 19:36:07', '-533', '-40', '1', '0', '1');
INSERT INTO `bike` VALUES ('266', 'ZH000108', '2017-05-11 19:36:07', '-984', '536', '1', '0', '1');
INSERT INTO `bike` VALUES ('267', 'ZH000109', '2017-05-11 19:36:07', '-183', '-93', '1', '0', '1');
INSERT INTO `bike` VALUES ('268', 'ZH000110', '2017-05-11 19:36:07', '-323', '348', '1', '0', '1');
INSERT INTO `bike` VALUES ('269', 'ZH000111', '2017-05-11 19:36:07', '86', '569', '1', '0', '1');
INSERT INTO `bike` VALUES ('270', 'ZH000112', '2017-05-11 19:36:07', '-276', '-781', '1', '0', '1');
INSERT INTO `bike` VALUES ('271', 'ZH000113', '2017-05-11 19:36:07', '-41', '383', '1', '0', '1');
INSERT INTO `bike` VALUES ('272', 'ZH000114', '2017-05-11 19:36:07', '346', '-914', '1', '0', '1');
INSERT INTO `bike` VALUES ('273', 'ZH000115', '2017-05-11 19:36:07', '126', '787', '1', '0', '1');
INSERT INTO `bike` VALUES ('274', 'ZH000116', '2017-05-11 19:36:07', '-270', '886', '1', '0', '1');
INSERT INTO `bike` VALUES ('275', 'ZH000117', '2017-05-11 19:36:07', '273', '219', '1', '0', '1');
INSERT INTO `bike` VALUES ('276', 'ZH000118', '2017-05-11 19:36:07', '-937', '558', '1', '0', '1');
INSERT INTO `bike` VALUES ('277', 'ZH000119', '2017-05-11 19:36:07', '-911', '115', '1', '0', '1');
INSERT INTO `bike` VALUES ('278', 'ZH000120', '2017-05-11 19:36:07', '532', '-961', '1', '0', '1');
INSERT INTO `bike` VALUES ('279', 'ZH000121', '2017-05-11 19:36:07', '259', '913', '1', '0', '1');
INSERT INTO `bike` VALUES ('280', 'ZH000122', '2017-05-11 19:36:07', '-674', '265', '1', '0', '1');
INSERT INTO `bike` VALUES ('281', 'ZH000123', '2017-05-11 19:36:07', '473', '52', '1', '0', '1');
INSERT INTO `bike` VALUES ('282', 'ZH000124', '2017-05-11 19:36:07', '-369', '-825', '1', '0', '1');
INSERT INTO `bike` VALUES ('283', 'ZH000125', '2017-05-11 19:36:07', '-583', '-32', '1', '0', '1');
INSERT INTO `bike` VALUES ('284', 'ZH000126', '2017-05-11 19:36:07', '635', '-294', '1', '0', '1');
INSERT INTO `bike` VALUES ('285', 'ZH000127', '2017-05-11 19:36:07', '-221', '99', '1', '0', '1');
INSERT INTO `bike` VALUES ('286', 'ZH000128', '2017-05-11 19:36:07', '527', '795', '1', '0', '1');
INSERT INTO `bike` VALUES ('287', 'ZH000129', '2017-05-11 19:36:07', '-753', '881', '1', '0', '1');
INSERT INTO `bike` VALUES ('288', 'ZH000130', '2017-05-11 19:36:07', '492', '381', '1', '0', '1');
INSERT INTO `bike` VALUES ('289', 'ZH000131', '2017-05-11 19:36:07', '507', '-246', '1', '0', '1');
INSERT INTO `bike` VALUES ('290', 'ZH000132', '2017-05-11 19:36:07', '719', '-599', '1', '0', '1');
INSERT INTO `bike` VALUES ('291', 'ZH000133', '2017-05-11 19:36:07', '-752', '-845', '1', '0', '1');
INSERT INTO `bike` VALUES ('292', 'ZH000134', '2017-05-11 19:36:07', '396', '-209', '1', '0', '1');
INSERT INTO `bike` VALUES ('293', 'ZH000135', '2017-05-11 19:36:07', '157', '519', '1', '0', '1');
INSERT INTO `bike` VALUES ('294', 'ZH000136', '2017-05-11 19:36:07', '-290', '489', '1', '0', '1');
INSERT INTO `bike` VALUES ('295', 'ZH000137', '2017-05-11 19:36:07', '921', '287', '1', '0', '1');
INSERT INTO `bike` VALUES ('296', 'ZH000138', '2017-05-11 19:36:07', '-153', '-565', '1', '0', '1');
INSERT INTO `bike` VALUES ('297', 'ZH000139', '2017-05-11 19:36:07', '229', '-106', '1', '0', '1');
INSERT INTO `bike` VALUES ('298', 'ZH000140', '2017-05-11 19:36:07', '996', '-436', '1', '0', '1');
INSERT INTO `bike` VALUES ('299', 'ZH000141', '2017-05-11 19:36:07', '-233', '-221', '1', '0', '1');
INSERT INTO `bike` VALUES ('300', 'ZH000142', '2017-05-11 19:36:07', '344', '813', '1', '0', '1');
INSERT INTO `bike` VALUES ('301', 'ZH000143', '2017-05-11 19:36:07', '222', '-622', '1', '0', '1');
INSERT INTO `bike` VALUES ('302', 'ZH000144', '2017-05-11 19:36:07', '80', '121', '1', '0', '1');
INSERT INTO `bike` VALUES ('303', 'ZH000145', '2017-05-11 19:36:07', '-716', '-870', '1', '0', '1');
INSERT INTO `bike` VALUES ('304', 'ZH000146', '2017-05-11 19:36:07', '-611', '-574', '1', '0', '1');
INSERT INTO `bike` VALUES ('305', 'ZH000147', '2017-05-11 19:36:07', '-362', '471', '1', '0', '1');
INSERT INTO `bike` VALUES ('306', 'ZH000148', '2017-05-11 19:36:07', '460', '-336', '1', '0', '1');
INSERT INTO `bike` VALUES ('307', 'ZH000149', '2017-05-11 19:36:07', '972', '-160', '1', '0', '1');
INSERT INTO `bike` VALUES ('308', 'ZH000150', '2017-05-11 19:36:07', '480', '773', '1', '0', '1');
INSERT INTO `bike` VALUES ('309', 'ZH000151', '2017-05-11 19:36:07', '-25', '673', '1', '0', '1');
INSERT INTO `bike` VALUES ('310', 'ZH000152', '2017-05-11 19:36:07', '-362', '-309', '1', '0', '1');
INSERT INTO `bike` VALUES ('311', 'ZH000153', '2017-05-11 19:36:07', '333', '-590', '1', '0', '1');
INSERT INTO `bike` VALUES ('312', 'ZH000154', '2017-05-11 19:36:07', '-881', '354', '1', '0', '1');
INSERT INTO `bike` VALUES ('313', 'ZH000155', '2017-05-11 19:36:07', '734', '-514', '1', '0', '1');
INSERT INTO `bike` VALUES ('314', 'ZH000156', '2017-05-11 19:36:07', '-888', '-298', '1', '0', '1');
INSERT INTO `bike` VALUES ('315', 'ZH000157', '2017-05-11 19:36:07', '866', '-661', '1', '0', '1');
INSERT INTO `bike` VALUES ('316', 'ZH000158', '2017-05-11 19:36:07', '803', '-329', '1', '0', '1');
INSERT INTO `bike` VALUES ('317', 'ZH000159', '2017-05-11 19:36:07', '-584', '407', '1', '0', '1');
INSERT INTO `bike` VALUES ('318', 'ZH000160', '2017-05-11 19:36:07', '382', '-802', '1', '0', '1');
INSERT INTO `bike` VALUES ('319', 'ZH000161', '2017-05-11 19:36:07', '71', '-872', '1', '0', '1');
INSERT INTO `bike` VALUES ('320', 'ZH000162', '2017-05-11 19:36:07', '-964', '221', '1', '0', '1');
INSERT INTO `bike` VALUES ('321', 'ZH000163', '2017-05-11 19:36:07', '-481', '937', '1', '0', '1');
INSERT INTO `bike` VALUES ('322', 'ZH000164', '2017-05-11 19:36:07', '950', '-322', '1', '0', '1');
INSERT INTO `bike` VALUES ('323', 'ZH000165', '2017-05-11 19:36:07', '-552', '275', '1', '0', '1');
INSERT INTO `bike` VALUES ('324', 'ZH000166', '2017-05-11 19:36:07', '-685', '-494', '1', '0', '1');
INSERT INTO `bike` VALUES ('325', 'ZH000167', '2017-05-11 19:36:07', '543', '578', '1', '0', '1');
INSERT INTO `bike` VALUES ('326', 'ZH000168', '2017-05-11 19:36:07', '315', '642', '1', '0', '1');
INSERT INTO `bike` VALUES ('327', 'ZH000169', '2017-05-11 19:36:07', '495', '283', '1', '0', '1');
INSERT INTO `bike` VALUES ('328', 'ZH000170', '2017-05-11 19:36:07', '-860', '-975', '1', '0', '1');
INSERT INTO `bike` VALUES ('329', 'ZH000171', '2017-05-11 19:36:07', '-10', '827', '1', '0', '1');
INSERT INTO `bike` VALUES ('330', 'ZH000172', '2017-05-11 19:36:07', '-23', '-409', '1', '0', '1');
INSERT INTO `bike` VALUES ('331', 'ZH000173', '2017-05-11 19:36:07', '715', '649', '1', '0', '1');
INSERT INTO `bike` VALUES ('332', 'ZH000174', '2017-05-11 19:36:07', '13', '278', '1', '0', '1');
INSERT INTO `bike` VALUES ('333', 'ZH000175', '2017-05-11 19:36:07', '-641', '-813', '1', '0', '1');
INSERT INTO `bike` VALUES ('334', 'ZH000176', '2017-05-11 19:36:07', '-565', '24', '1', '0', '1');
INSERT INTO `bike` VALUES ('335', 'ZH000177', '2017-05-11 19:36:07', '-392', '875', '1', '0', '1');
INSERT INTO `bike` VALUES ('336', 'ZH000178', '2017-05-11 19:36:07', '-568', '765', '1', '0', '1');
INSERT INTO `bike` VALUES ('337', 'ZH000179', '2017-05-11 19:36:07', '150', '-845', '1', '0', '1');
INSERT INTO `bike` VALUES ('338', 'ZH000180', '2017-05-11 19:36:07', '190', '-558', '1', '0', '1');
INSERT INTO `bike` VALUES ('339', 'ZH000181', '2017-05-11 19:36:07', '672', '461', '1', '0', '1');
INSERT INTO `bike` VALUES ('340', 'ZH000182', '2017-05-11 19:36:07', '898', '-12', '1', '0', '1');
INSERT INTO `bike` VALUES ('341', 'ZH000183', '2017-05-11 19:36:07', '-138', '232', '1', '0', '1');
INSERT INTO `bike` VALUES ('342', 'ZH000184', '2017-05-11 19:36:07', '-257', '-657', '1', '0', '1');
INSERT INTO `bike` VALUES ('343', 'ZH000185', '2017-05-11 19:36:07', '-592', '905', '1', '0', '1');
INSERT INTO `bike` VALUES ('344', 'ZH000186', '2017-05-11 19:36:07', '-88', '-555', '1', '0', '1');
INSERT INTO `bike` VALUES ('345', 'ZH000187', '2017-05-11 19:36:07', '-4', '-81', '1', '0', '1');
INSERT INTO `bike` VALUES ('346', 'ZH000188', '2017-05-11 19:36:07', '-408', '-770', '1', '0', '1');
INSERT INTO `bike` VALUES ('347', 'ZH000189', '2017-05-11 19:36:07', '-684', '-290', '1', '0', '1');
INSERT INTO `bike` VALUES ('348', 'ZH000190', '2017-05-11 19:36:07', '-28', '635', '1', '0', '1');
INSERT INTO `bike` VALUES ('349', 'ZH000191', '2017-05-11 19:36:07', '52', '-284', '1', '0', '1');
INSERT INTO `bike` VALUES ('350', 'ZH000192', '2017-05-11 19:36:07', '-762', '600', '1', '0', '1');
INSERT INTO `bike` VALUES ('351', 'ZH000193', '2017-05-11 19:36:07', '-105', '374', '1', '0', '1');
INSERT INTO `bike` VALUES ('352', 'ZH000194', '2017-05-11 19:36:07', '578', '-939', '1', '0', '1');
INSERT INTO `bike` VALUES ('353', 'ZH000195', '2017-05-11 19:36:07', '-469', '-878', '1', '0', '1');
INSERT INTO `bike` VALUES ('354', 'ZH000196', '2017-05-11 19:36:07', '181', '954', '1', '0', '1');
INSERT INTO `bike` VALUES ('355', 'ZH000197', '2017-05-11 19:36:07', '646', '396', '1', '0', '1');
INSERT INTO `bike` VALUES ('356', 'ZH000198', '2017-05-11 19:36:07', '-767', '220', '1', '0', '1');
INSERT INTO `bike` VALUES ('357', 'ZH000199', '2017-05-11 19:36:07', '-70', '-363', '1', '0', '1');
INSERT INTO `bike` VALUES ('358', 'ZH000200', '2017-05-11 19:36:07', '-79', '-206', '1', '0', '1');
INSERT INTO `bike` VALUES ('359', 'ZH000201', '2017-05-11 19:36:07', '-930', '-721', '1', '0', '1');
INSERT INTO `bike` VALUES ('360', 'ZH000202', '2017-05-11 19:36:07', '-567', '-385', '1', '0', '1');
INSERT INTO `bike` VALUES ('361', 'ZH000203', '2017-05-11 19:36:07', '752', '761', '1', '0', '1');
INSERT INTO `bike` VALUES ('362', 'ZH000204', '2017-05-11 19:36:07', '-43', '618', '1', '0', '1');
INSERT INTO `bike` VALUES ('363', 'ZH000205', '2017-05-11 19:36:07', '665', '520', '1', '0', '1');
INSERT INTO `bike` VALUES ('364', 'ZH000206', '2017-05-11 19:36:07', '680', '742', '1', '0', '1');
INSERT INTO `bike` VALUES ('365', 'ZH000207', '2017-05-11 19:36:07', '-504', '-5', '1', '0', '1');
INSERT INTO `bike` VALUES ('366', 'ZH000208', '2017-05-11 19:36:07', '-209', '926', '1', '0', '1');
INSERT INTO `bike` VALUES ('367', 'ZH000209', '2017-05-11 19:36:07', '932', '-378', '1', '0', '1');
INSERT INTO `bike` VALUES ('368', 'ZH000210', '2017-05-11 19:36:07', '475', '-894', '1', '0', '1');
INSERT INTO `bike` VALUES ('369', 'ZH000211', '2017-05-11 19:36:07', '-338', '838', '1', '0', '1');
INSERT INTO `bike` VALUES ('370', 'ZH000212', '2017-05-11 19:36:07', '921', '218', '1', '0', '1');
INSERT INTO `bike` VALUES ('371', 'ZH000213', '2017-05-11 19:36:07', '-629', '82', '1', '0', '1');
INSERT INTO `bike` VALUES ('372', 'ZH000214', '2017-05-11 19:36:07', '316', '203', '1', '0', '1');
INSERT INTO `bike` VALUES ('373', 'ZH000215', '2017-05-11 19:36:07', '748', '791', '1', '0', '1');
INSERT INTO `bike` VALUES ('374', 'ZH000216', '2017-05-11 19:36:07', '848', '-5', '1', '0', '1');
INSERT INTO `bike` VALUES ('375', 'ZH000217', '2017-05-11 19:36:07', '-518', '-598', '1', '0', '1');
INSERT INTO `bike` VALUES ('376', 'ZH000218', '2017-05-11 19:36:07', '-295', '-466', '1', '0', '1');
INSERT INTO `bike` VALUES ('377', 'ZH000219', '2017-05-11 19:36:07', '258', '-647', '1', '0', '1');
INSERT INTO `bike` VALUES ('378', 'ZH000220', '2017-05-11 19:36:07', '-927', '-243', '1', '0', '1');
INSERT INTO `bike` VALUES ('379', 'ZH000221', '2017-05-11 19:36:07', '764', '-918', '1', '0', '1');
INSERT INTO `bike` VALUES ('380', 'ZH000222', '2017-05-11 19:36:07', '139', '600', '1', '0', '1');
INSERT INTO `bike` VALUES ('381', 'ZH000223', '2017-05-11 19:36:07', '-311', '24', '1', '0', '1');
INSERT INTO `bike` VALUES ('382', 'ZH000224', '2017-05-11 19:36:07', '-906', '-997', '1', '0', '1');
INSERT INTO `bike` VALUES ('383', 'ZH000225', '2017-05-11 19:36:07', '719', '620', '1', '0', '1');
INSERT INTO `bike` VALUES ('384', 'ZH000226', '2017-05-11 19:36:07', '-878', '900', '1', '0', '1');
INSERT INTO `bike` VALUES ('385', 'ZH000227', '2017-05-11 19:36:07', '542', '305', '1', '0', '1');
INSERT INTO `bike` VALUES ('386', 'ZH000228', '2017-05-11 19:36:07', '411', '-767', '1', '0', '1');
INSERT INTO `bike` VALUES ('387', 'ZH000229', '2017-05-11 19:36:07', '845', '-482', '1', '0', '1');
INSERT INTO `bike` VALUES ('388', 'ZH000230', '2017-05-11 19:36:07', '150', '-65', '1', '0', '1');
INSERT INTO `bike` VALUES ('389', 'ZH000231', '2017-05-11 19:36:07', '317', '-305', '1', '0', '1');
INSERT INTO `bike` VALUES ('390', 'ZH000232', '2017-05-11 19:36:07', '526', '-53', '1', '0', '1');
INSERT INTO `bike` VALUES ('391', 'ZH000233', '2017-05-11 19:36:07', '644', '-725', '1', '0', '1');
INSERT INTO `bike` VALUES ('392', 'ZH000234', '2017-05-11 19:36:07', '726', '-795', '1', '0', '1');
INSERT INTO `bike` VALUES ('393', 'ZH000235', '2017-05-11 19:36:07', '514', '-305', '1', '0', '1');
INSERT INTO `bike` VALUES ('394', 'ZH000236', '2017-05-11 19:36:07', '937', '645', '1', '0', '1');
INSERT INTO `bike` VALUES ('395', 'ZH000237', '2017-05-11 19:36:07', '-386', '-608', '1', '0', '1');
INSERT INTO `bike` VALUES ('396', 'ZH000238', '2017-05-11 19:36:07', '348', '207', '1', '0', '1');
INSERT INTO `bike` VALUES ('397', 'ZH000239', '2017-05-11 19:36:07', '632', '-196', '1', '0', '1');
INSERT INTO `bike` VALUES ('398', 'ZH000240', '2017-05-11 19:36:07', '-853', '828', '1', '0', '1');
INSERT INTO `bike` VALUES ('399', 'ZH000241', '2017-05-11 19:36:07', '-743', '-632', '1', '0', '1');
INSERT INTO `bike` VALUES ('400', 'ZH000242', '2017-05-11 19:36:07', '518', '445', '1', '0', '1');
INSERT INTO `bike` VALUES ('401', 'ZH000243', '2017-05-11 19:36:07', '173', '-478', '1', '0', '1');
INSERT INTO `bike` VALUES ('402', 'ZH000244', '2017-05-11 19:36:07', '651', '-4', '1', '0', '1');
INSERT INTO `bike` VALUES ('403', 'ZH000245', '2017-05-11 19:36:07', '-929', '703', '1', '0', '1');
INSERT INTO `bike` VALUES ('404', 'ZH000246', '2017-05-11 19:36:07', '734', '-582', '1', '0', '1');
INSERT INTO `bike` VALUES ('405', 'ZH000247', '2017-05-11 19:36:07', '635', '349', '1', '0', '1');
INSERT INTO `bike` VALUES ('406', 'ZH000248', '2017-05-11 19:36:07', '953', '-352', '1', '0', '1');
INSERT INTO `bike` VALUES ('407', 'ZH000249', '2017-05-11 19:36:07', '556', '898', '1', '0', '1');
INSERT INTO `bike` VALUES ('408', 'ZH000250', '2017-05-11 19:36:07', '497', '624', '1', '0', '1');
INSERT INTO `bike` VALUES ('409', 'ZH000251', '2017-05-11 19:36:07', '-480', '-213', '1', '0', '1');
INSERT INTO `bike` VALUES ('410', 'ZH000252', '2017-05-11 19:36:07', '-447', '-716', '1', '0', '1');
INSERT INTO `bike` VALUES ('411', 'ZH000253', '2017-05-11 19:36:07', '-786', '-547', '1', '0', '1');
INSERT INTO `bike` VALUES ('412', 'ZH000254', '2017-05-11 19:36:07', '-692', '-435', '1', '0', '1');
INSERT INTO `bike` VALUES ('413', 'ZH000255', '2017-05-11 19:36:07', '326', '-667', '1', '0', '1');
INSERT INTO `bike` VALUES ('414', 'ZH000256', '2017-05-11 19:36:07', '-51', '404', '1', '0', '1');
INSERT INTO `bike` VALUES ('415', 'ZH000257', '2017-05-11 19:36:07', '543', '-134', '1', '0', '1');
INSERT INTO `bike` VALUES ('416', 'ZH000258', '2017-05-11 19:36:07', '664', '-260', '1', '0', '1');
INSERT INTO `bike` VALUES ('417', 'ZH000259', '2017-05-11 19:36:07', '554', '488', '1', '0', '1');
INSERT INTO `bike` VALUES ('418', 'ZH000260', '2017-05-11 19:36:07', '-358', '509', '1', '0', '1');
INSERT INTO `bike` VALUES ('419', 'ZH000261', '2017-05-11 19:36:07', '45', '-361', '1', '0', '1');
INSERT INTO `bike` VALUES ('420', 'ZH000262', '2017-05-11 19:36:07', '68', '650', '1', '0', '1');
INSERT INTO `bike` VALUES ('421', 'ZH000263', '2017-05-11 19:36:07', '-296', '753', '1', '0', '1');
INSERT INTO `bike` VALUES ('422', 'ZH000264', '2017-05-11 19:36:07', '131', '-901', '1', '0', '1');
INSERT INTO `bike` VALUES ('423', 'ZH000265', '2017-05-11 19:36:07', '-781', '271', '1', '0', '1');
INSERT INTO `bike` VALUES ('424', 'ZH000266', '2017-05-11 19:36:07', '-981', '-206', '1', '0', '1');
INSERT INTO `bike` VALUES ('425', 'ZH000267', '2017-05-11 19:36:07', '-724', '-371', '1', '0', '1');
INSERT INTO `bike` VALUES ('426', 'ZH000268', '2017-05-11 19:36:07', '918', '-327', '1', '0', '1');
INSERT INTO `bike` VALUES ('427', 'ZH000269', '2017-05-11 19:36:07', '-436', '-737', '1', '0', '1');
INSERT INTO `bike` VALUES ('428', 'ZH000270', '2017-05-11 19:36:07', '-983', '672', '1', '0', '1');
INSERT INTO `bike` VALUES ('429', 'ZH000271', '2017-05-11 19:36:07', '769', '612', '1', '0', '1');
INSERT INTO `bike` VALUES ('430', 'ZH000272', '2017-05-11 19:36:07', '-498', '-269', '1', '0', '1');
INSERT INTO `bike` VALUES ('431', 'ZH000273', '2017-05-11 19:36:07', '580', '114', '1', '0', '1');
INSERT INTO `bike` VALUES ('432', 'ZH000274', '2017-05-11 19:36:07', '-439', '785', '1', '0', '1');
INSERT INTO `bike` VALUES ('433', 'ZH000275', '2017-05-11 19:36:07', '-315', '-794', '1', '0', '1');
INSERT INTO `bike` VALUES ('434', 'ZH000276', '2017-05-11 19:36:07', '-618', '773', '1', '0', '1');
INSERT INTO `bike` VALUES ('435', 'ZH000277', '2017-05-11 19:36:07', '-230', '324', '1', '0', '1');
INSERT INTO `bike` VALUES ('436', 'ZH000278', '2017-05-11 19:36:07', '152', '-367', '1', '0', '1');
INSERT INTO `bike` VALUES ('437', 'ZH000279', '2017-05-11 19:36:07', '-478', '908', '1', '0', '1');
INSERT INTO `bike` VALUES ('438', 'ZH000280', '2017-05-11 19:36:07', '59', '300', '1', '0', '1');
INSERT INTO `bike` VALUES ('439', 'ZH000281', '2017-05-11 19:36:07', '630', '-605', '1', '0', '1');
INSERT INTO `bike` VALUES ('440', 'ZH000282', '2017-05-11 19:36:07', '290', '714', '1', '0', '1');
INSERT INTO `bike` VALUES ('441', 'ZH000283', '2017-05-11 19:36:07', '-218', '-779', '1', '0', '1');
INSERT INTO `bike` VALUES ('442', 'ZH000284', '2017-05-11 19:36:07', '-966', '-189', '1', '0', '1');
INSERT INTO `bike` VALUES ('443', 'ZH000285', '2017-05-11 19:36:07', '663', '823', '1', '0', '1');
INSERT INTO `bike` VALUES ('444', 'ZH000286', '2017-05-11 19:36:07', '-524', '-470', '1', '0', '1');
INSERT INTO `bike` VALUES ('445', 'ZH000287', '2017-05-11 19:36:07', '-37', '-358', '1', '0', '1');
INSERT INTO `bike` VALUES ('446', 'ZH000288', '2017-05-11 19:36:07', '-196', '807', '1', '0', '1');
INSERT INTO `bike` VALUES ('447', 'ZH000289', '2017-05-11 19:36:07', '-632', '112', '1', '0', '1');
INSERT INTO `bike` VALUES ('448', 'ZH000290', '2017-05-11 19:36:07', '-792', '-420', '1', '0', '1');
INSERT INTO `bike` VALUES ('449', 'ZH000291', '2017-05-11 19:36:07', '-434', '-328', '1', '0', '1');
INSERT INTO `bike` VALUES ('450', 'ZH000292', '2017-05-11 19:36:07', '-128', '787', '1', '0', '1');
INSERT INTO `bike` VALUES ('451', 'ZH000293', '2017-05-11 19:36:07', '244', '760', '1', '0', '1');
INSERT INTO `bike` VALUES ('452', 'ZH000294', '2017-05-11 19:36:07', '986', '365', '1', '0', '1');
INSERT INTO `bike` VALUES ('453', 'ZH000295', '2017-05-11 19:36:07', '91', '812', '1', '0', '1');
INSERT INTO `bike` VALUES ('454', 'ZH000296', '2017-05-11 19:36:07', '737', '-748', '1', '0', '1');
INSERT INTO `bike` VALUES ('455', 'ZH000297', '2017-05-11 19:36:07', '792', '267', '1', '0', '1');
INSERT INTO `bike` VALUES ('456', 'ZH000298', '2017-05-11 19:36:07', '312', '-616', '1', '0', '1');
INSERT INTO `bike` VALUES ('457', 'ZH000299', '2017-05-11 19:36:07', '-962', '562', '1', '0', '1');
INSERT INTO `bike` VALUES ('464', 'ZH000300', '2017-05-12 21:54:48', '0', '0', '1', '0', '1');
INSERT INTO `bike` VALUES ('465', 'HZ000810', '2017-05-13 13:53:26', '15', '-545', '1', '0', '1');

-- ----------------------------
-- Table structure for record
-- ----------------------------
DROP TABLE IF EXISTS `record`;
CREATE TABLE `record` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '纪录id;PK',
  `stime` datetime DEFAULT NULL COMMENT '开始时间',
  `etime` datetime DEFAULT NULL COMMENT '结束时间',
  `bikeid` int(11) DEFAULT NULL COMMENT '借用的自行车id;FK_bike(id)',
  `userid` int(11) DEFAULT NULL COMMENT '借用者id;FK_user(id)',
  `cost` float DEFAULT '0' COMMENT '费用',
  PRIMARY KEY (`id`),
  KEY `FK_bikeid` (`bikeid`),
  KEY `FK_user` (`userid`),
  CONSTRAINT `FK_bikeid` FOREIGN KEY (`bikeid`) REFERENCES `bike` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `FK_user` FOREIGN KEY (`userid`) REFERENCES `user` (`id`) ON DELETE SET NULL ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=90 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of record
-- ----------------------------

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '记录id;PK',
  `username` varchar(40) NOT NULL COMMENT '用户名;unique,not null',
  `mphone` varchar(20) DEFAULT NULL COMMENT '使用者电话;',
  `regtime` datetime DEFAULT NULL COMMENT '注册时间;date',
  `password` varchar(50) NOT NULL COMMENT '登录密码;not null',
  `salt` varchar(50) NOT NULL COMMENT '盐值;not null',
  `balance` float(255,2) DEFAULT '0.00' COMMENT '账户余额;默认0.00',
  `email` varchar(50) NOT NULL COMMENT '邮箱',
  `avatar` varchar(255) DEFAULT NULL COMMENT '头像',
  `is_use` int(255) NOT NULL DEFAULT '1' COMMENT '用户状态;1-启用;2-禁用,默认1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username_unique` (`username`) USING BTREE,
  UNIQUE KEY `email_unique` (`email`) USING BTREE,
  UNIQUE KEY `mphone_unique` (`mphone`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('27', 'cliven', '15846875279', '2017-05-11 19:37:17', 'bc0d9c3879891d1ac0c5d2a3d73c5f50', '46b3740d6c4e5b49c04f79196a4e7888', '234.00', 'quanguanyu@qq.com', '1495508381cliven.jpg', '1');
INSERT INTO `user` VALUES ('28', 'danbu', '15187879645', '2017-05-14 18:18:43', 'd2b7971fa15084abacc8b089de264187', '5855e75d4a80844cbc2554f031a6b2ba', '0.00', 'qun@163.com', 'default_avatar.jpg', '1');
